In [1]:
import re

In [2]:
# importing pandas 
import pandas as pd 

# merging two csv files 
df = pd.concat(map(pd.read_csv, ["E:\AC_projects_programs\quantium-starter-repo\data\daily_sales_data_0.csv", "E:\AC_projects_programs\quantium-starter-repo\data\daily_sales_data_1.csv", "E:\AC_projects_programs\quantium-starter-repo\data\daily_sales_data_2.csv"]), ignore_index=True) 
print(df)

                product  price  quantity        date region
0           pink morsel  $3.00       546  2018-02-06  north
1           pink morsel  $3.00       549  2018-02-06  south
2           pink morsel  $3.00       577  2018-02-06   east
3           pink morsel  $3.00       519  2018-02-06   west
4           gold morsel  $9.99       580  2018-02-06  north
...                 ...    ...       ...         ...    ...
41155  vermilion morsel  $4.99       475  2022-02-14   west
41156      lapis morsel  $1.99       425  2022-02-14  north
41157      lapis morsel  $1.99       454  2022-02-14  south
41158      lapis morsel  $1.99       483  2022-02-14   east
41159      lapis morsel  $1.99       427  2022-02-14   west

[41160 rows x 5 columns]

In [ ]:
#df.to_csv("E:\AC_projects_programs\quantium-starter-repo\data\merged_daily_sales_data.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41160 entries, 0 to 41159
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   41160 non-null  object
 1   price     41160 non-null  object
 2   quantity  41160 non-null  int64
 3   date      41160 non-null  object
 4   region    41160 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.6+ MB

In [4]:
df.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [5]:
new_df=df[df["product"]=="pink morsel"]

In [6]:
new_df

           product  price  quantity        date region
0      pink morsel  $3.00       546  2018-02-06  north
1      pink morsel  $3.00       549  2018-02-06  south
2      pink morsel  $3.00       577  2018-02-06   east
3      pink morsel  $3.00       519  2018-02-06   west
28     pink morsel  $3.00       529  2018-02-07  north
...            ...    ...       ...         ...    ...
41107  pink morsel  $5.00       478  2022-02-13   west
41132  pink morsel  $5.00       407  2022-02-14  north
41133  pink morsel  $5.00       493  2022-02-14  south
41134  pink morsel  $5.00       500  2022-02-14   east
41135  pink morsel  $5.00       423  2022-02-14   west

[5880 rows x 5 columns]

In [ ]:
#new_df["price"].astype(float)

In [7]:
new_df["price"]=new_df["price"].str.replace(r'\$', ' ', regex=True)

C:\Users\Varad\AppData\Local\Temp\ipykernel_17744\3815016107.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df["price"]=new_df["price"].str.replace(r'\$', ' ', regex=True)

In [8]:
new_df["price"]

0         3.00
1         3.00
2         3.00
3         3.00
28        3.00
         ...
41107     5.00
41132     5.00
41133     5.00
41134     5.00
41135     5.00
Name: price, Length: 5880, dtype: object

In [9]:
new_df.head()

        product  price  quantity        date region
0   pink morsel   3.00       546  2018-02-06  north
1   pink morsel   3.00       549  2018-02-06  south
2   pink morsel   3.00       577  2018-02-06   east
3   pink morsel   3.00       519  2018-02-06   west
28  pink morsel   3.00       529  2018-02-07  north

In [10]:
new_df["price"]=new_df["price"].astype(float)

C:\Users\Varad\AppData\Local\Temp\ipykernel_17744\2681939530.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df["price"]=new_df["price"].astype(float)

In [11]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5880 entries, 0 to 41135
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     5880 non-null   float64
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 275.6+ KB

In [12]:
new_df["sales"]=new_df.quantity*new_df.price

C:\Users\Varad\AppData\Local\Temp\ipykernel_17744\4051252047.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df["sales"]=new_df.quantity*new_df.price

In [13]:
new_df["sales"]

0        1638.0
1        1647.0
2        1731.0
3        1557.0
28       1587.0
          ...
41107    2390.0
41132    2035.0
41133    2465.0
41134    2500.0
41135    2115.0
Name: sales, Length: 5880, dtype: float64

In [14]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5880 entries, 0 to 41135
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   product   5880 non-null   object
 1   price     5880 non-null   float64
 2   quantity  5880 non-null   int64
 3   date      5880 non-null   object
 4   region    5880 non-null   object
 5   sales     5880 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 321.6+ KB

In [16]:
new_df.to_csv(r"E:\AC_projects_programs\quantium-starter-repo\data\updated_daily_sales_data.csv")

In [17]:
new_df=new_df.drop(columns=['product', 'price', 'quantity'])

In [18]:
new_df

             date region   sales
0      2018-02-06  north  1638.0
1      2018-02-06  south  1647.0
2      2018-02-06   east  1731.0
3      2018-02-06   west  1557.0
28     2018-02-07  north  1587.0
...           ...    ...     ...
41107  2022-02-13   west  2390.0
41132  2022-02-14  north  2035.0
41133  2022-02-14  south  2465.0
41134  2022-02-14   east  2500.0
41135  2022-02-14   west  2115.0

[5880 rows x 3 columns]

In [19]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5880 entries, 0 to 41135
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5880 non-null   object
 1   region  5880 non-null   object
 2   sales   5880 non-null   float64
dtypes: float64(1), object(2)
memory usage: 183.8+ KB

In [20]:
new_df=new_df[['sales', 'date', 'region']]

In [21]:
new_df

        sales        date region
0      1638.0  2018-02-06  north
1      1647.0  2018-02-06  south
2      1731.0  2018-02-06   east
3      1557.0  2018-02-06   west
28     1587.0  2018-02-07  north
...       ...         ...    ...
41107  2390.0  2022-02-13   west
41132  2035.0  2022-02-14  north
41133  2465.0  2022-02-14  south
41134  2500.0  2022-02-14   east
41135  2115.0  2022-02-14   west

[5880 rows x 3 columns]

In [24]:
new_df.to_csv(r"E:\AC_projects_programs\quantium-starter-repo\data\updated_daily_sales_data.csv")

In [25]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5880 entries, 0 to 41135
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sales   5880 non-null   float64
 1   date    5880 non-null   object
 2   region  5880 non-null   object
dtypes: float64(1), object(2)
memory usage: 183.8+ KB